---
kind: enumMember
id: F:Autodesk.Revit.Attributes.JournalingMode.UsingCommandData
enum: Autodesk.Revit.Attributes.JournalingMode
source: html/fb11f6be-d1e2-728a-9c43-26ae89c8cc7c.htm
---
# Autodesk.Revit.Attributes.JournalingMode.UsingCommandData

Uses the "StringStringMap" supplied in the command data. Hides all Revit journal entries
in between the external command invocation and the StringStringMap entry. Commands which invoke the
Revit UI for selection or for responses to task dialogs may not replay correctly.